text = """Nobody said it was easy
No one ever said it would be this hard"""

# а) Друкує весь рядок
print("а) Весь рядок:")
print(text)

# б) Друкує перший і останній символ
print("\nб) Перший і останній символ:")
print("Перший символ:", text[0])
print("Останній символ:", text[-1])

# в) Друкує перші 10 символів
print("\nв) Перші 10 символів:")
print(text[:10])

# г) Друкує відбитки з 19-го знака до 31-го
print("\nг) Відбитки з 19-го знака до 31-го:")
print(text[18:30])

# e) Друкує весь рядок великими літерами
print("\nе) Рядок великими літерами:")
print(text.upper())
